"""
มีผู้ป่วยรายนึง ไปโรงพยาบาลเพราะป่วยหนัก โดยขั้นแรกก่อนพบหมอ จะมีการสอบถามประวัติและชั่งน้ำหนัก ตามโจทย์คือจะให้วัดค่า BMI

โดยให้รับค่าดังนี่ (ส่วนนี้จะมีโค้ตให้เรียบร้อยแล้ว)
1. ชื่อของคุณ
2. น้ำหนักของคุณ หน่วยเป็นกิโลกรัม
3. ส่วนสูงของคุณ หน่วยเป็นเซนติเมตร

โดยสิ่งที่จะแสดงผลออกมาคือ
1. ชื่อของคุณ 
2. น้ำหนักของคุณ หน่วยเป็นกิโลกรัม เป็นทศนิยม 2 ตำแหน่ง
3. ส่วนสูงของคุณ หน่วยเป็นเซนติเมตร เป็นทศนิยม 2 ตำแหน่ง
4. ค่า BMI ของคุณ เป็นทศนิยม 2 ตำแหน่ง
5. เกณฑ์ BMI ของคุณ

สูตรหาค่า BMI = น้ำหนักตัว(กิโลกรัม) / ส่วนสูง(เมตร) ยกกำลัง 2

เกณฑ์ BMI
อ้วนมาก (30.0 ขึ้นไป)
อ้วน (25.0 - 29.9)
น้ำหนักเกิน (23.0 - 24.9)
น้ำหนักปกติ เหมาะสม (18.6 - 22.9)
ผอมเกินไป (น้อยกว่า 18.5)

"""
def main():
    name = input("ชื่อของคุณ คือ ")
    weight = float(input("น้ำหนักของคุณ (กิโลกรัม) คือ "))
    height = float(input("ส่วนสูงของคุณ (เซนติเมตร) คือ "))


main()
