"""
มีผู้ป่วยรายนึง ไปโรงพยาบาลเพราะป่วยหนัก โดยขั้นแรกก่อนพบหมอ จะมีการสอบถามประวัติและชั่งน้ำหนัก ตามโจทย์คือจะให้วัดค่า BMI

โดยให้รับค่าดังนี่ (ส่วนนี้จะมีโค้ตให้เรียบร้อยแล้ว)
1. ชื่อของคุณ
2. น้ำหนักของคุณ หน่วยเป็นกิโลกรัม
3. ส่วนสูงของคุณ หน่วยเป็นเซนติเมตร

โดยสิ่งที่จะแสดงผลออกมาคือ
1. ชื่อของคุณ 
2. น้ำหนักของคุณ หน่วยเป็นกิโลกรัม เป็นทศนิยม 2 ตำแหน่ง
3. ส่วนสูงของคุณ หน่วยเป็นเซนติเมตร เป็นทศนิยม 2 ตำแหน่ง
4. ค่า BMI ของคุณ เป็นทศนิยม 2 ตำแหน่ง
5. เกณฑ์ BMI ของคุณ

สูตรหาค่า BMI = น้ำหนักตัว(กิโลกรัม) / ส่วนสูง(เมตร) ยกกำลัง 2

"""
def main():
    name = input("ชื่อของคุณ คือ ")
    weight = float(input("น้ำหนักของคุณ (กิโลกรัม) คือ "))
    height = float(input("ส่วนสูงของคุณ (เซนติเมตร) คือ "))

    meter = height*0.01

    bmi = weight/meter**2

    print("ชื่อของคุณ คือ %s"%name)
    print("น้ำหนักของคุณ คือ %.2f กิโลกรัม"%weight)
    print("ส่วนสูงของคุณ คือ %.2f เซนติเมตร"%height)
    print("ค่า BMI ของคุณ คือ %.2f โดยอยู่ในเกณฑ์ ดังนี้"%bmi)

    if (bmi > 30):
        print("อ้วนมาก (30.0 ขึ้นไป)")
    elif (bmi >= 25.00 and bmi <= 29.99):
        print("อ้วน (25.0 - 29.9)")
    elif (bmi >= 23.00 and bmi <= 24.99):
        print("น้ำหนักเกิน (23.0 - 24.9)")
    elif (bmi >= 18.60 and bmi <= 22.99):
        print("น้ำหนักปกติ เหมาะสม (18.6 - 22.9)")
    else:
        print("ผอมเกินไป (น้อยกว่า 18.5)")

main()