"""
ข้อที่ 1 เขียนโปรแกรมเพื่อนแสดงลำดับตัวเลขจากฟังก์ชั่น range(1,10) ด้วยการใช้คำสั่ง for วนลูปแสดงจำนวนตัวเลขในลำดับพร้อมบอกว่าจำนวนคู่ หรือ คี่

"""
"""
def main():
    for i in range(1,10):
        if i % 2 == 0:
            print(i, "เป็นเลขคู่")
        else:
            print(i, "เป็นเลขคี่")
main()
"""
"""
ข้อที่ 2 ให้บอกรายชื่อครอบครัวโดยมีชื่อจริง ตามด้วยนามสกุล จริงใจ เหมือนกันทุกคน จำนวน 4 คน 
"""

def main():
    firstname = ["สมชาย","สมหญิง","สมหมาย","สมพงศ์"]
    lastname = ["จริงใจ"]

    for x in firstname:
        for y in lastname:
            print("รายชื่อสมาชิกครอบครัว",x ,y)
main()
