"""
ให้ เฟิร์ส มีเงิน 1000.00 บาท ซื้อผักและผลไม้ราคา 215 บาท ซื้อหมูราคา 15.12 บาท 
และไปเจอของเล่นราคา 250 บาท ขอลดราคา 50% จึงซื้อและได้ให้เบอร์ตัวเองกับเจ้าของร้าน 
คือเบอร์ 0123456789 ต่อมาได้กลับบ้านและนับจำนวนเงินที่เหลือมีค่าเท่าไหร่
***โดยให้ค่า input ในส่วนของ ชื่อเล่น, เงินที่ตัวเองมี, ราคาผักและผลไม้, ราคาหมู, ราคาของเล่น, เบอร์โทร
และค่าทศนิยมจะมี 2 ตำแหน่ง
"""
def main():
    name = input() #string ชื่อ
    money = float(input()) #เงินที่มี
    veg = int(input()) #ราคาผักผลไม้
    pork = float(input()) #ราคาหมู
    toy = int(input()) #ราคาของเล่น
    tel = input() #เบอร์โทรศัพท์

    saletoy = toy/2 #ราคาของเล่นที่ลด 50% แล้ว
    total = money-(veg+pork+saletoy) # ยอดที่เหลือ
    print("ชื่อตัวเอง : %s" %name)
    print("เบอร์โทร : %s" %tel)
    print("เงินที่ตัวเองมีทั้งหมด : %.2f บาท" %money) 
    print("ซื้อผักและผลไม้ : %d บาท" %veg)
    print("ซื้อหมู : %.2f บาท" %pork)
    print("ซื้อของเล่นราคา : %d บาท" %saletoy)
    print("ยอดที่เหลือ : %.2f บาท" %total)

main()
