"""
ข้อที่  1 จำนวน 1-20 โดยแสดงผลเป็นเลขคู่ และแสดงออกมาเป็นบรรทัดเดียวกัน โดยใช้คำสั่ง While
"""
#def main():
#    i = 0
#    while (i < 20):
#        i += 1
#        if (i%2 == 0):
#            print(i, end=" ")  
#main()
"""
ข้อที่  2 จำนวน 1-20 โดยแสดงผลเป็นเลขคี่ และแสดงออกมาเป็นบรรทัดเดียวกัน โดยใช้คำสั่ง For
"""
#def main():
#    for i in range(20):
#        if (i%2 == 1):
#            print(i, end=" ")  
#main()
"""
ข้อที่  3จำนวน 1 และ 2 โดยแสดงผลเป็นคู่ และแสดงออกมาเป็นบรรทัดเดียวกัน โดยใช้คำสั่ง Nested Loop หรือ Loop ซ้อน Loop
"""

def main():
    num1 = ["1", "2"]
    num2 = ["1", "2"]
    for x in num1:
        for y in num2:
            print(x,y, end="/")
main()
